In [1]:
import numpy as np
import pandas as pd

## Basic data structures in pandas

1. 'Series': a one-dimensional labeled array holding data of any type

2. 'DataFrame': a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

## Object Creation
- Series

In [5]:
s= pd.Series([91,4,5,np.nan, 6,8])
s

0    91.0
1     4.0
2     5.0
3     NaN
4     6.0
5     8.0
dtype: float64

- DataFrame

In [10]:
dates= pd.date_range('20240101', periods=6)
dates

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df= pd.DataFrame(np.random.randn(6,4),index= dates, columns=list("ABCD"))
df

                   A         B         C         D
2024-01-01 -1.815900 -0.005056  1.051223 -0.413009
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718
2024-01-04 -0.264555  0.151149  0.700875 -1.227981
2024-01-05  1.243429 -0.134667  0.015801 -0.720147
2024-01-06 -0.591437  1.398511 -1.373075 -2.223226

In [14]:
list("ABCD")

['A', 'B', 'C', 'D']

In [15]:
df2= pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
        
    }

)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
np.array([3] * 4)

array([3, 3, 3, 3])

In [17]:
pd.Series(1, index=list(range(4)))

0    1
1    1
2    1
3    1
dtype: int64

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [19]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## Viewing data

In [21]:
df.head()

                   A         B         C         D
2024-01-01 -1.815900 -0.005056  1.051223 -0.413009
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718
2024-01-04 -0.264555  0.151149  0.700875 -1.227981
2024-01-05  1.243429 -0.134667  0.015801 -0.720147

In [22]:
df.tail()

                   A         B         C         D
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718
2024-01-04 -0.264555  0.151149  0.700875 -1.227981
2024-01-05  1.243429 -0.134667  0.015801 -0.720147
2024-01-06 -0.591437  1.398511 -1.373075 -2.223226

In [23]:
df.index

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [25]:
df.to_numpy()

array([[-1.81590026, -0.00505619,  1.05122291, -0.4130089 ],
       [-1.25761841, -0.55482857, -0.28803522, -1.30885431],
       [-0.68864494, -0.88086403,  1.63832988, -1.95371813],
       [-0.26455521,  0.15114871,  0.70087501, -1.22798088],
       [ 1.24342906, -0.13466717,  0.01580094, -0.72014673],
       [-0.59143714,  1.39851077, -1.37307499, -2.22322601]])

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.562454 -0.004293  0.290853 -1.307822
std    1.041259  0.784918  1.071578  0.693913
min   -1.815900 -0.880864 -1.373075 -2.223226
25%   -1.115375 -0.449788 -0.212076 -1.792502
50%   -0.640041 -0.069862  0.358338 -1.268418
75%   -0.346276  0.112097  0.963636 -0.847105
max    1.243429  1.398511  1.638330 -0.413009

In [27]:
df.T

   2024-01-01  2024-01-02  2024-01-03  2024-01-04  2024-01-05  2024-01-06
A   -1.815900   -1.257618   -0.688645   -0.264555    1.243429   -0.591437
B   -0.005056   -0.554829   -0.880864    0.151149   -0.134667    1.398511
C    1.051223   -0.288035    1.638330    0.700875    0.015801   -1.373075
D   -0.413009   -1.308854   -1.953718   -1.227981   -0.720147   -2.223226

In [29]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2024-01-01 -0.413009  1.051223 -0.005056 -1.815900
2024-01-02 -1.308854 -0.288035 -0.554829 -1.257618
2024-01-03 -1.953718  1.638330 -0.880864 -0.688645
2024-01-04 -1.227981  0.700875  0.151149 -0.264555
2024-01-05 -0.720147  0.015801 -0.134667  1.243429
2024-01-06 -2.223226 -1.373075  1.398511 -0.591437

In [32]:
df.sort_values(by="B")

                   A         B         C         D
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854
2024-01-05  1.243429 -0.134667  0.015801 -0.720147
2024-01-01 -1.815900 -0.005056  1.051223 -0.413009
2024-01-04 -0.264555  0.151149  0.700875 -1.227981
2024-01-06 -0.591437  1.398511 -1.373075 -2.223226

## Selection

In [33]:
df[0:3] # exclude index=3

                   A         B         C         D
2024-01-01 -1.815900 -0.005056  1.051223 -0.413009
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718

In [34]:
df["A"]

2024-01-01   -1.815900
2024-01-02   -1.257618
2024-01-03   -0.688645
2024-01-04   -0.264555
2024-01-05    1.243429
2024-01-06   -0.591437
Freq: D, Name: A, dtype: float64

## Selection by Label

In [35]:
df.loc[dates[0]]

A   -1.815900
B   -0.005056
C    1.051223
D   -0.413009
Name: 2024-01-01 00:00:00, dtype: float64

In [40]:
df.loc[:, ['A', 'B']]
df.loc["20240102":"20240104", ["A", "B"]]

                   A         B
2024-01-02 -1.257618 -0.554829
2024-01-03 -0.688645 -0.880864
2024-01-04 -0.264555  0.151149

In [42]:
df.at[dates[0], "A"]

-1.815900257298753

## Selection by position

In [43]:
df.iloc[3] #ROW

A   -0.264555
B    0.151149
C    0.700875
D   -1.227981
Name: 2024-01-04 00:00:00, dtype: float64

In [46]:
df.iloc[3:5, 0:2]

                   A         B
2024-01-04 -0.264555  0.151149
2024-01-05  1.243429 -0.134667

In [48]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2024-01-02 -1.257618 -0.288035
2024-01-03 -0.688645  1.638330
2024-01-05  1.243429  0.015801

In [49]:
df.iloc[:, [1]]

                   B
2024-01-01 -0.005056
2024-01-02 -0.554829
2024-01-03 -0.880864
2024-01-04  0.151149
2024-01-05 -0.134667
2024-01-06  1.398511

In [51]:
df.iat[1,1]

-0.5548285669494348

## Boolean Indexing

In [56]:
df[df['A']>0]

                   A         B         C         D
2024-01-05  1.243429 -0.134667  0.015801 -0.720147

In [58]:
df[df>0]

                   A         B         C   D
2024-01-01       NaN       NaN  1.051223 NaN
2024-01-02       NaN       NaN       NaN NaN
2024-01-03       NaN       NaN  1.638330 NaN
2024-01-04       NaN  0.151149  0.700875 NaN
2024-01-05  1.243429       NaN  0.015801 NaN
2024-01-06       NaN  1.398511       NaN NaN

In [59]:
df2=df.copy()
df2["E"]= ["one", "one", "two", "three", "four", "three"]
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718   two
2024-01-05  1.243429 -0.134667  0.015801 -0.720147  four

In [60]:
df2["E"].isin(["two", "four"])

2024-01-01    False
2024-01-02    False
2024-01-03     True
2024-01-04    False
2024-01-05     True
2024-01-06    False
Freq: D, Name: E, dtype: bool

## Setting

In [74]:
s1= pd.Series([1,2,3,4,5,6], index= pd.date_range("20240101", periods=6))
s1
df["F"] = s1
df

                   A         B         C         D  F
2024-01-01  0.000000 -0.005056  1.051223 -0.413009  1
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854  2
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718  3
2024-01-04 -0.264555  0.151149  0.700875 -1.227981  4
2024-01-05  1.243429 -0.134667  0.015801 -0.720147  5
2024-01-06 -0.591437  1.398511 -1.373075 -2.223226  6

In [75]:
df.at[dates[0], "A"]=0
df

                   A         B         C         D  F
2024-01-01  0.000000 -0.005056  1.051223 -0.413009  1
2024-01-02 -1.257618 -0.554829 -0.288035 -1.308854  2
2024-01-03 -0.688645 -0.880864  1.638330 -1.953718  3
2024-01-04 -0.264555  0.151149  0.700875 -1.227981  4
2024-01-05  1.243429 -0.134667  0.015801 -0.720147  5
2024-01-06 -0.591437  1.398511 -1.373075 -2.223226  6

In [77]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D  F
2024-01-01  0.000000 -0.005056  1.051223  5.0  1
2024-01-02 -1.257618 -0.554829 -0.288035  5.0  2
2024-01-03 -0.688645 -0.880864  1.638330  5.0  3
2024-01-04 -0.264555  0.151149  0.700875  5.0  4
2024-01-05  1.243429 -0.134667  0.015801  5.0  5
2024-01-06 -0.591437  1.398511 -1.373075  5.0  6

In [79]:
df2=df.copy()
df2[df2>0]= -df2
df2

                   A         B         C    D  F
2024-01-01  0.000000 -0.005056 -1.051223 -5.0 -1
2024-01-02 -1.257618 -0.554829 -0.288035 -5.0 -2
2024-01-03 -0.688645 -0.880864 -1.638330 -5.0 -3
2024-01-04 -0.264555 -0.151149 -0.700875 -5.0 -4
2024-01-05 -1.243429 -0.134667 -0.015801 -5.0 -5
2024-01-06 -0.591437 -1.398511 -1.373075 -5.0 -6

## Missing data

In [96]:
#Reindexing 
df1= df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1

                   A         B         C    D  F   E
2024-01-01  0.000000 -0.005056  1.051223  5.0  1 NaN
2024-01-02 -1.257618 -0.554829 -0.288035  5.0  2 NaN
2024-01-03 -0.688645 -0.880864  1.638330  5.0  3 NaN
2024-01-04 -0.264555  0.151149  0.700875  5.0  4 NaN

In [97]:
df1.loc[dates[0]:dates[1], "E"]=1
df1

                   A         B         C    D  F    E
2024-01-01  0.000000 -0.005056  1.051223  5.0  1  1.0
2024-01-02 -1.257618 -0.554829 -0.288035  5.0  2  1.0
2024-01-03 -0.688645 -0.880864  1.638330  5.0  3  NaN
2024-01-04 -0.264555  0.151149  0.700875  5.0  4  NaN

In [98]:
#df.dropna()
df1.dropna(how='any')

                   A         B         C    D  F    E
2024-01-01  0.000000 -0.005056  1.051223  5.0  1  1.0
2024-01-02 -1.257618 -0.554829 -0.288035  5.0  2  1.0

In [99]:
#df.fillna()
df1.fillna(5)

                   A         B         C    D  F    E
2024-01-01  0.000000 -0.005056  1.051223  5.0  1  1.0
2024-01-02 -1.257618 -0.554829 -0.288035  5.0  2  1.0
2024-01-03 -0.688645 -0.880864  1.638330  5.0  3  5.0
2024-01-04 -0.264555  0.151149  0.700875  5.0  4  5.0

In [100]:
#isna()
pd.isna(df1)

                A      B      C      D      F      E
2024-01-01  False  False  False  False  False  False
2024-01-02  False  False  False  False  False  False
2024-01-03  False  False  False  False  False   True
2024-01-04  False  False  False  False  False   True

## Stats

In [101]:
# mean of each column
df.mean()

A   -0.259804
B   -0.004293
C    0.290853
D    5.000000
F    3.500000
dtype: float64

In [102]:
#mean of row
df.mean(axis=1)

2024-01-01    1.409233
2024-01-02    0.979904
2024-01-03    1.613764
2024-01-04    1.917494
2024-01-05    2.224913
2024-01-06    2.086800
Freq: D, dtype: float64

In [108]:
#shift()
s= pd.Series([1,3,5, np.nan, 6, 8], index=dates).shift(2)
s

2024-01-01    NaN
2024-01-02    NaN
2024-01-03    1.0
2024-01-04    3.0
2024-01-05    5.0
2024-01-06    NaN
Freq: D, dtype: float64

## User defined functions

In [110]:
df.agg(lambda x: np.mean(x)*5.6)

A    -1.454905
B    -0.024039
C     1.628777
D    28.000000
F    19.600000
dtype: float64

In [113]:
df.transform(lambda x: x*101.2)

                     A           B           C      D      F
2024-01-01    0.000000   -0.511687  106.383758  506.0  101.2
2024-01-02 -127.270983  -56.148651  -29.149164  506.0  202.4
2024-01-03  -69.690867  -89.143439  165.798983  506.0  303.6
2024-01-04  -26.772987   15.296250   70.928552  506.0  404.8
2024-01-05  125.835021  -13.628318    1.599055  506.0  506.0
2024-01-06  -59.853438  141.529290 -138.955189  506.0  607.2

## Value count

In [115]:
s= pd.Series(np.random.randint(0,7, size=10))
s

0    3
1    1
2    4
3    1
4    5
5    6
6    2
7    6
8    0
9    6
dtype: int64

In [116]:
s.value_counts()

6    3
1    2
3    1
4    1
5    1
2    1
0    1
Name: count, dtype: int64

## String Methods

In [118]:
s= pd.Series(['A', 'B', 'C', "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [119]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge
### Concat

In [121]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.957655  0.113769  1.003507  2.957511
1 -0.107148 -1.409275 -2.598254  0.462807
2  0.513285  0.974546 -0.126198  0.160572
3  0.133254 -1.347055  1.523685  0.938847
4 -1.616529  1.701334  0.598974 -1.396630
5 -0.425686 -0.389514  2.828713  1.047904
6 -1.688313 -0.184123  0.175127 -0.629851
7  0.652064 -1.044758  0.192276  1.356320
8  1.164655 -1.141420  1.347906 -0.588210
9 -0.811108  1.056008 -0.754299  0.087043

In [123]:
#concat(): Concatenating pandas objects together row-wise 
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.957655  0.113769  1.003507  2.957511
1 -0.107148 -1.409275 -2.598254  0.462807
2  0.513285  0.974546 -0.126198  0.160572
3  0.133254 -1.347055  1.523685  0.938847
4 -1.616529  1.701334  0.598974 -1.396630
5 -0.425686 -0.389514  2.828713  1.047904
6 -1.688313 -0.184123  0.175127 -0.629851
7  0.652064 -1.044758  0.192276  1.356320
8  1.164655 -1.141420  1.347906 -0.588210
9 -0.811108  1.056008 -0.754299  0.087043

### Join

In [124]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [125]:
left

   key  lval
0  foo     1
1  foo     2

In [126]:
right

   key  rval
0  foo     4
1  foo     5

In [129]:
#pd.merge()
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Grouping

In [132]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.920991 -0.019857
1  bar    one  1.831610  0.919802
2  foo    two  0.873950  0.617887
3  bar  three -0.533429  0.000786
4  foo    two -0.447136  0.311754
5  bar    two -0.710207 -1.209946
6  foo    one  0.068937  0.442405
7  foo  three  0.288368 -0.898515

In [138]:
# DataFrameGroupBy.sum()
#Grouping by 1 column label, selecting column labels, 
#and then applying the sum func
df.groupby('A')[['C','D']].sum()

            C         D
A
bar  0.587974 -0.289358
foo -0.136872  0.453675

In [140]:
#Grouping by multiple column label
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.831610  0.919802
    three -0.533429  0.000786
    two   -0.710207 -1.209946
foo one   -0.852054  0.422548
    three  0.288368 -0.898515
    two    0.426814  0.929641